---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryXTranslationFixed
source: html/50240c11-0b89-b0c4-586d-2254f5d5102f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryXTranslationFixed Property

"X Translation - Fixed"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryXTranslationFixed { get; }
```